examples/cavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

rho             	rho [1 -3 0 0 0 0 0] 999.845079;

//liquid phase
cp_L             	cpl [0 2 -2 -1 0 0 0] 4200;
k_L         	 	k_L [1 1 -3 -1 0 0 0] 0.56;
nu              	nu [0 2 -1 0 0 0 0] 1.787e-06;

//solid phase
cp_S            	cps [0 2 -2 -1 0 0 0] 2060;
k_S             	k_S [1 1 -3 -1 0 0 0] 2.33;
beta            	beta [0 0 0 -1 0 0 0] 1.0;

TRef            	TRef [0 0 0 1 0 0 0] 273.1;
T_S             	T_S [0 0 0 1 0 0 0] 273.1;
T_L             	T_L [0 0 0 1 0 0 0] 273.15;
h_m             	h_m [0 2 -2 0 0 0 0] 333700;
DarcyConstant   	DarcyConstant [1 -3 -1 0 0 0 0] 1.0e8;
DarcyTerm_epsilon	DarcyTerm_epsilon [0 0 0 0 0 0 0] 1e-06;

// ************************************************************************* //
